{"scheme_name": "HDFCFlexi Cap Fund", "amc_name": "HDFC Asset Management Company Limited", "category": "Know More Invest Now Funds Category Equity Debt Index Fund of Funds Tax Saver Hybrid Solution Oriented ETF Goal based solutions Wealth creation Tax Savings Children's Fund Retirement Planning Income Solutions Chhoti SIP VIEW ALL Learn MF Simplified Blogs Quiz Videos Zindagi ke liye SIP Macros, Markets and More Market Review Monetary Policy HDFC MF Yearbook Webinars Deep Dives Tuesday Talking Point Weekend Bytes HDFC MF Insights Handbooks MD and CEO'S Desk Interviews and Articles Videos Calculators SIP Calculator SWAP Calculator Top up SIP Impact of inflation STP calculator Goal SIP Present value Retirement SIP Calculator Cost of child education Investor Services Fund Related Details Factsheet Fund Documents Fund Literature Additional fund Information Our Online Services MF Online Investors Quick Invest Update Contact Details Forms & Disclosures Statutory Disclosures Forms, Addenda & Notices FAQ’s Investor Awareness Program IAP Downloads Investor Awareness Programmes KYC & Redressal of Complaints About Us Corporate Profile HDFC MF at a Glance Corporate Social Responsibility What we stand for What Sets Us Apart Environmental, Social and Governance AMC Shareholder Financial Information Corporate Governance Forms & Circulars MOA & AOA Others Media Center Our Board and Trustees Distributor Corner Login Become an MFD Onboard Digitally Forms & Disclosures One Click Link FAQs S I G N I N -A A +A HDFC Flexi Cap Fund Equity DIRECT REGULAR An open ended dynamic equity scheme investing across large cap, mid cap & small cap stocks. This is a simple and performing scheme which is eligible for distribution by new cadre of distributors. Investment Objective : To generate capital appreciation / income from a portfolio, predominantly invested in equity & equity related instruments. There is no assurance that the investment objective of the Scheme will be realized. For SIP performance click here . Returns since inception 16.97% Inception Date 01/01/2013 Riskometer Very High Min SIP ₹ 100 Ideal for Wealth Creation 3 Years and above Entry Load An entry load is a fee charged to investors when they purchase units of a Mutual Fund scheme. This fee was used to cover distribution and marketing expenses incurred by the Asset Management Company (AMC). Currently, Mutual Funds in India do not levy entry loads. NA TER TER The Total Expense Ration (TER) represents the costs for running and managing a Mutual Fund scheme. It is calculated as a percentage of the scheme’s average Net Asset Value (NAV). The daily NAV of a Mutual Fund is disclosed after deducting these expenses. Disclaimer Including Additional Expenses and Goods and Service Tax on Management Fees, if any. Click here to view the Total Expense Ratio 0.67 Lock in A lock-in period is the fixed duration during which investors cannot sell or redeem their investments/Mutual Fund units. For example, Equity Linked Savings Schemes (ELSS) Funds have a 3-year lock-in. NA NAV NA Net Asset Value (NAV) per unit is the total market value of securities of a scheme minus liabilities divided by the total number of outstanding units on a given date. NA AUM (31/10/2025) Assets Under Management (AUM) is the total market value of all assets that a Mutual Fund manages on behalf of its investors. ₹91,041.00 Cr. Benchmark A benchmark is a standard market index used to compare a Fund’s performance. It helps investors know whether the Fund is performing better, worse, or similar to the market. NIFTY 500 Total Retu... NIFTY 500 Total Returns Index INVEST NOW Performance No data available Scheme Returns (%) Benchmark Returns (%)# Additional Benchmark Returns (%)## Value of Investment of Rs 10,000 Scheme Returns (Rs.) Benchmark (Rs.)# Additional Benchmark (Rs.)## ^Past performance may or may not be sustained in future and is not a guarantee of any future returns.# Nifty 500 TRI ## Nifty 50 T... Read More Fund Managers Ms. Roshi Jain Senior Fund Manager - Equities OVERSEAS Mr. Dhruv Muchhal Equity Analyst and Fund Manager for Overseas Investments Top 10 Holdings As on 31 Oct 2025 Downloads HDFC Flexi Cap Fund SID - HDFC Flexi Cap Fund dated May 30, 2025 KIM - HDFC Flexi Cap Fund dated May 30, 2025 Fund Facts - HDFC Flexi Cap Fund_October 25.pdf Presentation HDFC Flexi Cap Fund Leaflet (As of September 2025) Exit Load In respect of each purchase / switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed / switched-out within 1 year from the date of allotment. No Exit Load is payable if Units are redeemed / switched-out after 1 year from the date of allotment. Product Labelling Benchmark Riskometer This product is suitable for investors who are seeking~ • To generate long-term capital appreciation / income • Investment predominantly in equity & equity related instruments ~Investors should consult their financial advisers if in doubt about whether the product is suitable for them. FAQs Who should invest in HDFC Flexi Cap Fund? This product is suitable for investors who are seeking~ To generate long-term capital appreciation / income Investment predominantly in equity & equity related instruments ~ Investors should consult their financial advisers, if in doubt about whether the product is suitable for them How to Invest in HDFC Flexi Cap Investors can apply for their transactions requests either offline or electronically using the relevant application / transaction request forms available on our website or at any of our Officials Points of Acceptance. The application form/transaction slip for subscription/ redemption/ switches can be submitted at our Official Points of Acceptances whose addresses are available on the website of the AMC. These include: 1.    AMC / RTA’s branches i.e. Investor Services Centres* 2.    HDFC MF website and App/ RTA website for Investors to transact 3.    MFSS/BSE StAR MF/NMF II platforms of the Stock Exchanges(s) 4.    Authorized Points of Service of MF Utilities India Private Limited (MFUI) 5.    Channel partners/ Distributors/ RIAs/ Portfolio Managers/Execution Only Platforms (EOPs) who have tied up with the AMC 6.    MF Central * Note: Business Centres i.e. Sales offices of HDFC AMC are not Official Points of Acceptance of transactions. Please refer offer documents for more details How to Redeem HDFC Flexi Cap? Units of the scheme can be redeemed/switched out on any Business day at NAV based prices. For Redemption (including switch-out) applications In respect of valid applications received upto 3 p.m. on a Business Day by the Fund, same day's closing NAV shall be applicable. In respect of valid applications received after 3 p.m. on a Business Day by the Fund, the closing NAV of the next Business Day shall be applicable. Transactions through online facilities / electronic modes: The time of transaction done through various online facilities / electronic modes offered by the AMC, for the purpose of determining the applicability of NAV, would be the time when the request for purchase / sale / switch of units is received in the servers of AMC/RTA. The AMC has the right to amend cut off timings subject to SEBI (MF) Regulations for the smooth and efficient functioning of the Scheme. Please refer Scheme Documents above for more details Can I invest in SIP and a Lump Sum of the HDFC Flexi Cap Fund? Yes, SIP as well as Lump Sum investments are permitted with the minimum application amount being ₹100. Any additional purchase must have a minimum amount of ₹100. The SIP and Lumpsum are available in direct and regular plan with both Growth and IDCW option. OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world Address HDFC House, 2nd floor, 166, HT Parekh Marg, Churchgate, Mumbai, Maharashtra 400020, India Contact Us 180030106767 [email protected] 8270682706 Follow Us IMPORTANT LINKS PMS/AIF (Login) Statutory Disclosures (MF/ AIF/ PMS) Contact Us Careers ODR Portal for AMC Shareholders ODR for Investors (HDFC MF, PMS and AIF) HDFC Mutual Fund Glossary Public Caution Notice Chhoti SIP INVESTORS Total Expense Ratio (TER) NAV and IDCW FAQ’s Monthly & Fortnightly Scheme Portfolio Market Update DOWNLOADS Forms Product Information Factsheet Scheme Annual Report Scheme Performance Summary Addendum & Notices DISTRIBUTORS Log In Become an MFD Onboard Digitally Forms & Disclosures One click Link FAQs Fund Categories: Equity Debt Hybrid Solution Oriented Fund of Funds ETF Tax Saver Index Close Ended Most Searched Funds: HDFC Flexi Cap Fund HDFC Balanced Advantage Fund HDFC Large Cap Fund HDFC Mid Cap Fund HDFC Small Cap Fund View All Calculators: cost of child education calculator goal sip calculator Inflation Calculator present value calculator Retirement Calculator SIP Calculator STP Calculator SWAP Calculator top up sip calculator HDFC Group Websites: HDFC Bank HDFC Securities HDFC Ergo HDB Financial Services HDFC Capital HDFC Life HDFC Pension HDFC Sales HT Parekh Foundation Info & Disclosures: Disclaimer Privacy Policy Sitemap MUTUAL FUND INVESTMENTS ARE SUBJECT TO MARKET RISKS, READ ALL SCHEME RELATED DOCUMENTS CAREFULLY ©Copyright 2025 . All rights reserved.", "plan_type": "Direct", "option": null, "risk_level": "Very High", "fund_rating": null, "nav_date": null, "nav_value": null, "fund_size_cr": 91041.0, "min_lumpsum_first_investment": null, "min_lumpsum_additional": null, "min_sip_amount": 100.0, "returns_1y_percent": null, "returns_3y_percent": null, "returns_5y_percent": null, "returns_all_percent": 16.97, "category_avg_1y_percent": null, "category_avg_3y_percent": null, "category_avg_5y_percent": null, "category_avg_all_percent": null, "rank_within_category_1y": null, "rank_within_category_3y": null, "rank_within_category_5y": null, "rank_within_category_all": null, "top_5_holdings_weight_percent": null, "top_20_holdings_weight_percent": null, "pe_ratio": null, "pb_ratio": null, "alpha": null, "beta": null, "sharpe_ratio": null, "sortino_ratio": null, "expense_ratio_percent": 0.67, "expense_ratio_inclusive_of_gst": true, "exit_load_text": "In respect of each purchase / switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed / switched-out within 1 year from the date of allotment. No Exit Load is payable if Units are redeemed / switched-out after 1 year from the date of allotment.", "stamp_duty_text": null, "tax_implication_text": null, "fund_manager_name": "Roshi Jain Senior Fund Manager, Dhruv Muchhal Equity Analyst", "fund_manager_since": null, "fund_manager_tenure_text": null, "source_url": "https://www.hdfcfund.com/explore/mutual-funds/hdfc-flexi-cap-fund/direct", "last_scraped_at": "2025-11-17T14:12:47.500061+00:00"}
{"scheme_name": "HDFCBalanced Advantage Fund", "amc_name": "HDFC Asset Management Company Limited", "category": "Know More Invest Now Funds Category Equity Debt Index Fund of Funds Tax Saver Hybrid Solution Oriented ETF Goal based solutions Wealth creation Tax Savings Children's Fund Retirement Planning Income Solutions Chhoti SIP VIEW ALL Learn MF Simplified Blogs Quiz Videos Zindagi ke liye SIP Macros, Markets and More Market Review Monetary Policy HDFC MF Yearbook Webinars Deep Dives Tuesday Talking Point Weekend Bytes HDFC MF Insights Handbooks MD and CEO'S Desk Interviews and Articles Videos Calculators SIP Calculator SWAP Calculator Top up SIP Impact of inflation STP calculator Goal SIP Present value Retirement SIP Calculator Cost of child education Investor Services Fund Related Details Factsheet Fund Documents Fund Literature Additional fund Information Our Online Services MF Online Investors Quick Invest Update Contact Details Forms & Disclosures Statutory Disclosures Forms, Addenda & Notices FAQ’s Investor Awareness Program IAP Downloads Investor Awareness Programmes KYC & Redressal of Complaints About Us Corporate Profile HDFC MF at a Glance Corporate Social Responsibility What we stand for What Sets Us Apart Environmental, Social and Governance AMC Shareholder Financial Information Corporate Governance Forms & Circulars MOA & AOA Others Media Center Our Board and Trustees Distributor Corner Login Become an MFD Onboard Digitally Forms & Disclosures One Click Link FAQs S I G N I N -A A +A HDFC Balanced Advantage Fund Hybrid DIRECT REGULAR An open ended Balanced Advantage Fund. This Fund aims to provide long term capital appreciation/income from a mix of equity and debt investments. Different asset classes exhibit different risk-return profile and relatively low correlation to each other as compared to investments within the same asset class. The fund manager will determine asset allocation between equity and debt depending on prevailing market and economic conditions. The debt-equity mix at any point of time will be a function of interest rates, equity valuations, medium to long term outlook of the asset classes and risk management , etc. Returns since inception 15.47% Inception Date 01/01/2013 Riskometer Very High Min SIP ₹ 100 Ideal for Wealth Creation 3 Years and above Entry Load An entry load is a fee charged to investors when they purchase units of a Mutual Fund scheme. This fee was used to cover distribution and marketing expenses incurred by the Asset Management Company (AMC). Currently, Mutual Funds in India do not levy entry loads. NA TER TER The Total Expense Ration (TER) represents the costs for running and managing a Mutual Fund scheme. It is calculated as a percentage of the scheme’s average Net Asset Value (NAV). The daily NAV of a Mutual Fund is disclosed after deducting these expenses. Disclaimer Including Additional Expenses and Goods and Service Tax on Management Fees, if any. Click here to view the Total Expense Ratio 0.73 Lock in A lock-in period is the fixed duration during which investors cannot sell or redeem their investments/Mutual Fund units. For example, Equity Linked Savings Schemes (ELSS) Funds have a 3-year lock-in. NA NAV NA Net Asset Value (NAV) per unit is the total market value of securities of a scheme minus liabilities divided by the total number of outstanding units on a given date. NA AUM (31/10/2025) Assets Under Management (AUM) is the total market value of all assets that a Mutual Fund manages on behalf of its investors. ₹106,493.54 Cr. Benchmark A benchmark is a standard market index used to compare a Fund’s performance. It helps investors know whether the Fund is performing better, worse, or similar to the market. NIFTY 50 Hybrid Comp... NIFTY 50 Hybrid Composite Debt 50:50 Index INVEST NOW Performance No data available Scheme Returns (%) Benchmark Returns (%)# Additional Benchmark Returns (%)## Value of Investment of Rs 10,000 Scheme Returns (Rs.) Benchmark (Rs.)# Additional Benchmark (Rs.)## ^Past performance may or may not be sustained in future and is not a guarantee of any future returns. # Nifty 50 Hybrid Composite ... Read More Fund Managers Mr. Srinivasan Ramamurthy Senior Fund Manager - Equities Mr. Gopal Agrawal Senior Fund Manager  ‑ Equity Mr. Anil Bamboli Senior Fund Manager - Fixed Income Mr. Arun Agarwal Senior Fund Manager Nandita Menezes Fund Manager and Dealer - Equities OVERSEAS Mr. Dhruv Muchhal Equity Analyst and Fund Manager for Overseas Investments Top 10 Holdings As on 31 Oct 2025 Downloads HDFC Balanced Advantage Fund SID - HDFC Balanced Advantage Fund dated May 30, 2025 KIM - HDFC Balanced Advantage Fund dated May 30, 2025 Fund Facts - HDFC Balanced Advantage Fund_October 25.pdf Presentation - HDFC Balanced Advantage Fund (Oct 2025) Leaflet - HDFC Balanced Advantage Fund (November 2025) Exit Load In respect of each purchase/switch-in of Units, 15% of the units (“the limit”) may be redeemed without any exit load from the date of allotment. Any redemption in excess of the limit shall be subject to the following exit load: Exit load of 1.00% is payable if Units are redeemed/switched-out within 1 year from thedate of allotment of units. No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and units allotted on dividend reinvestment. Product Labelling Benchmark Riskometer This product is suitable for investors who are seeking~ to generate long-term capital appreciation/income nvestments in a mix of equity and debt instruments ~Investors should consult their financial advisers if in doubt about whether the product is suitable for them. FAQs Can I invest in SIP and Lump Sum of HDFC Balanced Advantage Fund ? Yes, SIP as well as Lump Sum investments are permitted with the minimum application amount being ₹100. Any additional purchase must have a minimum amount of ₹100. The SIP and Lumpsum are available in direct and regular plan with both Growth and IDCW option. How to Invest in HDFC Balanced Advantage Fund? Investors can apply for their transactions requests either offline or electronically using the relevant application / transaction request forms available on our website or at any of our Officials Points of Acceptance. The application form/transaction slip for subscription/ redemption/ switches can be submitted at our Official Points of Acceptances whose addresses are available on the website of the AMC. These include: AMC / RTA’s branches i.e. Investor Services Centres* HDFC MF website and App/ RTA website for Investors to transact MFSS/BSE StAR MF/NMF II platforms of the Stock Exchanges(s) Authorized Points of Service of MF Utilities India Private Limited (MFUI) Channel partners/ Distributors/ RIAs/ Portfolio Managers/Execution Only Platforms (EOPs) who have tied up with the AMC MF Central *Note: Business Centres i.e. Sales offices of HDFC AMC are not Official Points of Acceptance of transactions. Please refer Scheme Documents above for more details How to Redeem HDFC Balanced Advantage Fund? Units of the scheme can be redeemed/switched out on any Business day at NAV based prices. For Redemption (including switch-out) applications •    In respect of valid applications received upto 3 p.m. on a Business Day by the Fund, same day's closing NAV shall be applicable. •    In respect of valid applications received after 3 p.m. on a Business Day by the Fund, the closing NAV of the next Business Day shall be applicable. Transactions through online facilities / electronic modes: The time of transaction done through various online facilities / electronic modes offered by the AMC, for the purpose of determining the applicability of NAV, would be the time when the request for purchase / sale / switch of units is received in the servers of AMC/RTA. The AMC has the right to amend cut off timings subject to SEBI (MF) Regulations for the smooth and efficient functioning of the Scheme. OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world Address HDFC House, 2nd floor, 166, HT Parekh Marg, Churchgate, Mumbai, Maharashtra 400020, India Contact Us 180030106767 [email protected] 8270682706 Follow Us IMPORTANT LINKS PMS/AIF (Login) Statutory Disclosures (MF/ AIF/ PMS) Contact Us Careers ODR Portal for AMC Shareholders ODR for Investors (HDFC MF, PMS and AIF) HDFC Mutual Fund Glossary Public Caution Notice Chhoti SIP INVESTORS Total Expense Ratio (TER) NAV and IDCW FAQ’s Monthly & Fortnightly Scheme Portfolio Market Update DOWNLOADS Forms Product Information Factsheet Scheme Annual Report Scheme Performance Summary Addendum & Notices DISTRIBUTORS Log In Become an MFD Onboard Digitally Forms & Disclosures One click Link FAQs Fund Categories: Equity Debt Hybrid Solution Oriented Fund of Funds ETF Tax Saver Index Close Ended Most Searched Funds: HDFC Flexi Cap Fund HDFC Balanced Advantage Fund HDFC Large Cap Fund HDFC Mid Cap Fund HDFC Small Cap Fund View All Calculators: cost of child education calculator goal sip calculator Inflation Calculator present value calculator Retirement Calculator SIP Calculator STP Calculator SWAP Calculator top up sip calculator HDFC Group Websites: HDFC Bank HDFC Securities HDFC Ergo HDB Financial Services HDFC Capital HDFC Life HDFC Pension HDFC Sales HT Parekh Foundation Info & Disclosures: Disclaimer Privacy Policy Sitemap MUTUAL FUND INVESTMENTS ARE SUBJECT TO MARKET RISKS, READ ALL SCHEME RELATED DOCUMENTS CAREFULLY ©Copyright 2025 . All rights reserved.", "plan_type": "Direct", "option": null, "risk_level": "low", "fund_rating": null, "nav_date": null, "nav_value": null, "fund_size_cr": 106493.54, "min_lumpsum_first_investment": null, "min_lumpsum_additional": null, "min_sip_amount": 100.0, "returns_1y_percent": null, "returns_3y_percent": null, "returns_5y_percent": null, "returns_all_percent": 15.47, "category_avg_1y_percent": null, "category_avg_3y_percent": null, "category_avg_5y_percent": null, "category_avg_all_percent": null, "rank_within_category_1y": null, "rank_within_category_3y": null, "rank_within_category_5y": null, "rank_within_category_all": null, "top_5_holdings_weight_percent": null, "top_20_holdings_weight_percent": null, "pe_ratio": null, "pb_ratio": null, "alpha": null, "beta": null, "sharpe_ratio": null, "sortino_ratio": null, "expense_ratio_percent": 0.73, "expense_ratio_inclusive_of_gst": true, "exit_load_text": "In respect of each purchase/switch-in of Units, 15% of the units (“the limit”) may be redeemed without any exit load from the date of allotment. Any redemption in excess of the limit shall be subject to the following exit load: Exit load of 1.00% is payable if Units are redeemed/switched-out within 1 year from thedate of allotment of units. No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and uni", "stamp_duty_text": null, "tax_implication_text": null, "fund_manager_name": "Srinivasan Ramamurthy Senior Fund Manager, Gopal Agrawal Senior Fund Manager, Anil Bamboli Senior Fund Manager, Arun Agarwal Senior Fund Manager Nandita Menezes Fund Manager, Dhruv Muchhal Equity Analyst", "fund_manager_since": null, "fund_manager_tenure_text": null, "source_url": "https://www.hdfcfund.com/explore/mutual-funds/hdfc-balanced-advantage-fund/direct", "last_scraped_at": "2025-11-17T14:12:47.763632+00:00"}
{"scheme_name": "HDFCLarge Cap Fund", "amc_name": "HDFC Asset Management Company Limited", "category": "Know More Invest Now Funds Category Equity Debt Index Fund of Funds Tax Saver Hybrid Solution Oriented ETF Goal based solutions Wealth creation Tax Savings Children's Fund Retirement Planning Income Solutions Chhoti SIP VIEW ALL Learn MF Simplified Blogs Quiz Videos Zindagi ke liye SIP Macros, Markets and More Market Review Monetary Policy HDFC MF Yearbook Webinars Deep Dives Tuesday Talking Point Weekend Bytes HDFC MF Insights Handbooks MD and CEO'S Desk Interviews and Articles Videos Calculators SIP Calculator SWAP Calculator Top up SIP Impact of inflation STP calculator Goal SIP Present value Retirement SIP Calculator Cost of child education Investor Services Fund Related Details Factsheet Fund Documents Fund Literature Additional fund Information Our Online Services MF Online Investors Quick Invest Update Contact Details Forms & Disclosures Statutory Disclosures Forms, Addenda & Notices FAQ’s Investor Awareness Program IAP Downloads Investor Awareness Programmes KYC & Redressal of Complaints About Us Corporate Profile HDFC MF at a Glance Corporate Social Responsibility What we stand for What Sets Us Apart Environmental, Social and Governance AMC Shareholder Financial Information Corporate Governance Forms & Circulars MOA & AOA Others Media Center Our Board and Trustees Distributor Corner Login Become an MFD Onboard Digitally Forms & Disclosures One Click Link FAQs S I G N I N -A A +A HDFC Large Cap Fund Equity DIRECT REGULAR An open ended equity scheme predominantly investing in large cap stocks. This is a simple and performing scheme which is eligible for distribution by new cadre of distributors. The Scheme aims to provide long-term capital appreciation. It will maintain a minimum exposure of 80% to Large Cap stocks, as defined by SEBI, which currently are the 100 largest companies in India in terms of full market capitalization. Generally, large cap companies are well established businesses that are in operation for a longer period of time and are well positioned to absorb business pressures across various market cycles. Due to their size, they also benefit from economies of scale. The Scheme will remain diversified across key sectors and economic variables. Returns since inception 13.99% Inception Date 01/01/2013 Riskometer Very High Min SIP ₹ 100 Ideal for Wealth Creation 3 Years and above Entry Load An entry load is a fee charged to investors when they purchase units of a Mutual Fund scheme. This fee was used to cover distribution and marketing expenses incurred by the Asset Management Company (AMC). Currently, Mutual Funds in India do not levy entry loads. NA TER TER The Total Expense Ration (TER) represents the costs for running and managing a Mutual Fund scheme. It is calculated as a percentage of the scheme’s average Net Asset Value (NAV). The daily NAV of a Mutual Fund is disclosed after deducting these expenses. Disclaimer Including Additional Expenses and Goods and Service Tax on Management Fees, if any. Click here to view the Total Expense Ratio 0.97 Lock in A lock-in period is the fixed duration during which investors cannot sell or redeem their investments/Mutual Fund units. For example, Equity Linked Savings Schemes (ELSS) Funds have a 3-year lock-in. NA NAV NA Net Asset Value (NAV) per unit is the total market value of securities of a scheme minus liabilities divided by the total number of outstanding units on a given date. NA AUM (31/10/2025) Assets Under Management (AUM) is the total market value of all assets that a Mutual Fund manages on behalf of its investors. ₹39,779.26 Cr. Benchmark A benchmark is a standard market index used to compare a Fund’s performance. It helps investors know whether the Fund is performing better, worse, or similar to the market. NIFTY 100 (Total Ret... NIFTY 100 (Total Return Index) INVEST NOW Performance No data available Scheme Returns (%) Benchmark Returns (%)# Additional Benchmark Returns (%)## Value of Investment of Rs 10,000 Scheme Returns (Rs.) Benchmark (Rs.)# Additional Benchmark (Rs.)## ^Past performance may or may not be sustained in future and is not a guarantee of any future returns. # Nifty 100 TRI ## BSE SENSE... Read More Fund Managers Mr. Rahul Baijal Senior Member Investment Team (Equity) OVERSEAS Mr. Dhruv Muchhal Equity Analyst and Fund Manager for Overseas Investments Top 10 Holdings As on 31 Oct 2025 Downloads HDFC Large Cap Fund SID - HDFC Large Cap Fund dated May 30, 2025 KIM - HDFC Large Cap Fund dated May 30, 2025 Leaflet HDFC Large Cap Fund Presentation (September 2025) Fund Facts - HDFC Large Cap Fund_October 25.pdf Exit Load ● In respect of each purchase/switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed/switched-out within 1 year from the date of allotment. ● No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and units allotted on dividend reinvestment Product Labelling Benchmark Riskometer This product is suitable for investors who are seeking~ • to generate long-term capital appreciation/income • investment predominantly in Large-Cap companies ~Investors should consult their financial advisers if in doubt about whether the product is suitable for them FAQs What are the top holdings in the HDFC Top 100 Fund's portfolio? Click here Who should consider investing in the HDFC Top 100 Fund? This product is suitable for investors who are seeking~ To generate long-term capital appreciation / income Investment predominantly in Large-cap companies ~ Investors should consult their financial advisers, if in doubt about whether the product is suitable for them How to Invest in HDFC Top 100 Fund? Investors can apply for their transactions requests either offline or electronically using the relevant application / transaction request forms available on our website or at any of our Officials Points of Acceptance. The application form/transaction slip for subscription/ redemption/ switches can be submitted at our Official Points of Acceptances whose addresses are available on the website of the AMC. These include: AMC / RTA’s branches i.e. Investor Services Centres* HDFC MF website and App/ RTA website for Investors to transact MFSS/BSE StAR MF/NMF II platforms of the Stock Exchanges(s) Authorized Points of Service of MF Utilities India Private Limited (MFUI) Channel partners/ Distributors/ RIAs/ Portfolio Managers/Execution Only Platforms (EOPs) who have tied up with the AMC MF Central * Note: Business Centres i.e. Sales offices of HDFC AMC are not Official Points of Acceptance of transactions. The above list is indicative. For further details, including cut-off timing and applicability of NAV, refer Section II. Please refer Scheme Documents above for more details OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world Address HDFC House, 2nd floor, 166, HT Parekh Marg, Churchgate, Mumbai, Maharashtra 400020, India Contact Us 180030106767 [email protected] 8270682706 Follow Us IMPORTANT LINKS PMS/AIF (Login) Statutory Disclosures (MF/ AIF/ PMS) Contact Us Careers ODR Portal for AMC Shareholders ODR for Investors (HDFC MF, PMS and AIF) HDFC Mutual Fund Glossary Public Caution Notice Chhoti SIP INVESTORS Total Expense Ratio (TER) NAV and IDCW FAQ’s Monthly & Fortnightly Scheme Portfolio Market Update DOWNLOADS Forms Product Information Factsheet Scheme Annual Report Scheme Performance Summary Addendum & Notices DISTRIBUTORS Log In Become an MFD Onboard Digitally Forms & Disclosures One click Link FAQs Fund Categories: Equity Debt Hybrid Solution Oriented Fund of Funds ETF Tax Saver Index Close Ended Most Searched Funds: HDFC Flexi Cap Fund HDFC Balanced Advantage Fund HDFC Large Cap Fund HDFC Mid Cap Fund HDFC Small Cap Fund View All Calculators: cost of child education calculator goal sip calculator Inflation Calculator present value calculator Retirement Calculator SIP Calculator STP Calculator SWAP Calculator top up sip calculator HDFC Group Websites: HDFC Bank HDFC Securities HDFC Ergo HDB Financial Services HDFC Capital HDFC Life HDFC Pension HDFC Sales HT Parekh Foundation Info & Disclosures: Disclaimer Privacy Policy Sitemap MUTUAL FUND INVESTMENTS ARE SUBJECT TO MARKET RISKS, READ ALL SCHEME RELATED DOCUMENTS CAREFULLY ©Copyright 2025 . All rights reserved.", "plan_type": "Direct", "option": null, "risk_level": "Very High", "fund_rating": null, "nav_date": null, "nav_value": null, "fund_size_cr": 39779.26, "min_lumpsum_first_investment": null, "min_lumpsum_additional": null, "min_sip_amount": 100.0, "returns_1y_percent": null, "returns_3y_percent": null, "returns_5y_percent": null, "returns_all_percent": 13.99, "category_avg_1y_percent": null, "category_avg_3y_percent": null, "category_avg_5y_percent": null, "category_avg_all_percent": null, "rank_within_category_1y": null, "rank_within_category_3y": null, "rank_within_category_5y": null, "rank_within_category_all": null, "top_5_holdings_weight_percent": null, "top_20_holdings_weight_percent": null, "pe_ratio": null, "pb_ratio": null, "alpha": null, "beta": null, "sharpe_ratio": null, "sortino_ratio": null, "expense_ratio_percent": 0.97, "expense_ratio_inclusive_of_gst": true, "exit_load_text": "● In respect of each purchase/switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed/switched-out within 1 year from the date of allotment. ● No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and units allotted on dividend reinvestment", "stamp_duty_text": null, "tax_implication_text": null, "fund_manager_name": "Rahul Baijal Senior Member Investment Team, Dhruv Muchhal Equity Analyst", "fund_manager_since": null, "fund_manager_tenure_text": null, "source_url": "https://www.hdfcfund.com/explore/mutual-funds/hdfc-large-cap-fund/direct", "last_scraped_at": "2025-11-17T14:12:47.944536+00:00"}
{"scheme_name": "HDFCMid Cap Fund", "amc_name": "HDFC Asset Management Company Limited", "category": "Know More Invest Now Funds Category Equity Debt Index Fund of Funds Tax Saver Hybrid Solution Oriented ETF Goal based solutions Wealth creation Tax Savings Children's Fund Retirement Planning Income Solutions Chhoti SIP VIEW ALL Learn MF Simplified Blogs Quiz Videos Zindagi ke liye SIP Macros, Markets and More Market Review Monetary Policy HDFC MF Yearbook Webinars Deep Dives Tuesday Talking Point Weekend Bytes HDFC MF Insights Handbooks MD and CEO'S Desk Interviews and Articles Videos Calculators SIP Calculator SWAP Calculator Top up SIP Impact of inflation STP calculator Goal SIP Present value Retirement SIP Calculator Cost of child education Investor Services Fund Related Details Factsheet Fund Documents Fund Literature Additional fund Information Our Online Services MF Online Investors Quick Invest Update Contact Details Forms & Disclosures Statutory Disclosures Forms, Addenda & Notices FAQ’s Investor Awareness Program IAP Downloads Investor Awareness Programmes KYC & Redressal of Complaints About Us Corporate Profile HDFC MF at a Glance Corporate Social Responsibility What we stand for What Sets Us Apart Environmental, Social and Governance AMC Shareholder Financial Information Corporate Governance Forms & Circulars MOA & AOA Others Media Center Our Board and Trustees Distributor Corner Login Become an MFD Onboard Digitally Forms & Disclosures One Click Link FAQs S I G N I N -A A +A HDFC Mid Cap Fund Equity DIRECT REGULAR An open ended equity scheme predominantly investing in mid cap stocks. The Scheme shall follow a predominantly Mid cap strategy with a minimum exposure of 65% to Mid-Cap stocks. The Scheme may also seek participation in other equity and equity related securities to achieve optimal portfolio construction. The aim of equity strategy will be to predominantly build a portfolio of mid-cap companies which have: a) reasonable growth prospects b) sound financial strength c) sustainable business models d) acceptable valuation that offers potential for capital appreciation. Returns since inception 20.91% Inception Date 01/01/2013 Riskometer Very High Min SIP ₹ 100 Ideal for Wealth Creation 3 Years and above Entry Load An entry load is a fee charged to investors when they purchase units of a Mutual Fund scheme. This fee was used to cover distribution and marketing expenses incurred by the Asset Management Company (AMC). Currently, Mutual Funds in India do not levy entry loads. NA TER TER The Total Expense Ration (TER) represents the costs for running and managing a Mutual Fund scheme. It is calculated as a percentage of the scheme’s average Net Asset Value (NAV). The daily NAV of a Mutual Fund is disclosed after deducting these expenses. Disclaimer Including Additional Expenses and Goods and Service Tax on Management Fees, if any. Click here to view the Total Expense Ratio 0.71 Lock in A lock-in period is the fixed duration during which investors cannot sell or redeem their investments/Mutual Fund units. For example, Equity Linked Savings Schemes (ELSS) Funds have a 3-year lock-in. NA NAV NA Net Asset Value (NAV) per unit is the total market value of securities of a scheme minus liabilities divided by the total number of outstanding units on a given date. NA AUM (31/10/2025) Assets Under Management (AUM) is the total market value of all assets that a Mutual Fund manages on behalf of its investors. ₹89,383.24 Cr. Benchmark A benchmark is a standard market index used to compare a Fund’s performance. It helps investors know whether the Fund is performing better, worse, or similar to the market. NIFTY Midcap 150 Ind... NIFTY Midcap 150 Index (Total Returns Index) INVEST NOW Performance No data available Scheme Returns (%) Benchmark Returns (%)# Additional Benchmark Returns (%)## Value of Investment of Rs 10,000 Scheme Returns (Rs.) Benchmark (Rs.)# Additional Benchmark (Rs.)## ^Past performance may or may not be sustained in future and is not a guarantee of any future returns. # Nifty Midcap 150 Index TRI... Read More Fund Managers Mr. Chirag Setalvad Fund Manger- Head of Equities OVERSEAS Mr. Dhruv Muchhal Equity Analyst and Fund Manager for Overseas Investments Top 10 Holdings As on 31 Oct 2025 Downloads HDFC Mid Cap Fund SID - HDFC Mid-Cap Opportunities Fund dated May 30, 2025 KIM - HDFC Mid-Cap Opportunities Fund dated May 30, 2025 Leaflet HDFC Mid Cap Fund Presentation (October 2025) Fund Facts - HDFC Mid-Cap Fund_October 25.pdf Exit Load ● In respect of each purchase/switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed/switched-out within 1 year from the date of allotment. ● No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and units allotted on dividend reinvestment Product Labelling Benchmark Riskometer This product is suitable for investors who are seeking~ • to generate long-term capital appreciation/income • investments predominantly in Mid-Cap companies ~Investors should consult their financial advisers if in doubt about whether the product is suitable for them. FAQs Can I invest in SIP and Lump Sum of HDFC Mid Cap Fund ? Yes, SIP as well as Lump Sum investments are permitted with the minimum application amount being ₹100. Any additional purchase must have a minimum amount of ₹100. The SIP and Lumpsum are available in direct and regular plan with both Growth and IDCW option. How to Invest in HDFC Mid Cap Fund ? Investors can apply for their transactions requests either offline or electronically using the relevant application / transaction request forms available on our website or at any of our Officials Points of Acceptance. The application form/transaction slip for subscription/ redemption/ switches can be submitted at our Official Points of Acceptances whose addresses are available on the website of the AMC. These include: AMC / RTA’s branches i.e. Investor Services Centres* HDFC MF website and App/ RTA website for Investors to transact MFSS/BSE StAR MF/NMF II platforms of the Stock Exchanges(s) Authorized Points of Service of MF Utilities India Private Limited (MFUI) Channel partners/ Distributors/ RIAs/ Portfolio Managers/Execution Only Platforms (EOPs) who have tied up with the AMC MF Central *Note: Business Centres i.e. Sales offices of HDFC AMC are not Official Points of Acceptance of transactions. The above list is indicative. For further details, including cut-off timing and applicability of NAV, refer Section II. Please refer Scheme Documents above for more details OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world Address HDFC House, 2nd floor, 166, HT Parekh Marg, Churchgate, Mumbai, Maharashtra 400020, India Contact Us 180030106767 [email protected] 8270682706 Follow Us IMPORTANT LINKS PMS/AIF (Login) Statutory Disclosures (MF/ AIF/ PMS) Contact Us Careers ODR Portal for AMC Shareholders ODR for Investors (HDFC MF, PMS and AIF) HDFC Mutual Fund Glossary Public Caution Notice Chhoti SIP INVESTORS Total Expense Ratio (TER) NAV and IDCW FAQ’s Monthly & Fortnightly Scheme Portfolio Market Update DOWNLOADS Forms Product Information Factsheet Scheme Annual Report Scheme Performance Summary Addendum & Notices DISTRIBUTORS Log In Become an MFD Onboard Digitally Forms & Disclosures One click Link FAQs Fund Categories: Equity Debt Hybrid Solution Oriented Fund of Funds ETF Tax Saver Index Close Ended Most Searched Funds: HDFC Flexi Cap Fund HDFC Balanced Advantage Fund HDFC Large Cap Fund HDFC Mid Cap Fund HDFC Small Cap Fund View All Calculators: cost of child education calculator goal sip calculator Inflation Calculator present value calculator Retirement Calculator SIP Calculator STP Calculator SWAP Calculator top up sip calculator HDFC Group Websites: HDFC Bank HDFC Securities HDFC Ergo HDB Financial Services HDFC Capital HDFC Life HDFC Pension HDFC Sales HT Parekh Foundation Info & Disclosures: Disclaimer Privacy Policy Sitemap MUTUAL FUND INVESTMENTS ARE SUBJECT TO MARKET RISKS, READ ALL SCHEME RELATED DOCUMENTS CAREFULLY ©Copyright 2025 . All rights reserved.", "plan_type": "Direct", "option": null, "risk_level": "low", "fund_rating": null, "nav_date": null, "nav_value": null, "fund_size_cr": 89383.24, "min_lumpsum_first_investment": null, "min_lumpsum_additional": null, "min_sip_amount": 100.0, "returns_1y_percent": null, "returns_3y_percent": null, "returns_5y_percent": null, "returns_all_percent": 20.91, "category_avg_1y_percent": null, "category_avg_3y_percent": null, "category_avg_5y_percent": null, "category_avg_all_percent": null, "rank_within_category_1y": null, "rank_within_category_3y": null, "rank_within_category_5y": null, "rank_within_category_all": null, "top_5_holdings_weight_percent": null, "top_20_holdings_weight_percent": null, "pe_ratio": null, "pb_ratio": null, "alpha": null, "beta": null, "sharpe_ratio": null, "sortino_ratio": null, "expense_ratio_percent": 0.71, "expense_ratio_inclusive_of_gst": true, "exit_load_text": "● In respect of each purchase/switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed/switched-out within 1 year from the date of allotment. ● No Exit Load is payable if Units are redeemed/switched-out after 1 year from the date of allotment. No Entry/Exit Load shall be levied on bonus units and units allotted on dividend reinvestment", "stamp_duty_text": null, "tax_implication_text": null, "fund_manager_name": "Chirag Setalvad Fund Manger, Dhruv Muchhal Equity Analyst", "fund_manager_since": null, "fund_manager_tenure_text": null, "source_url": "https://www.hdfcfund.com/explore/mutual-funds/hdfc-mid-cap-fund/direct", "last_scraped_at": "2025-11-17T14:12:48.133249+00:00"}
{"scheme_name": "HDFCSmall Cap Fund", "amc_name": "HDFC Asset Management Company Limited", "category": "Know More Invest Now Funds Category Equity Debt Index Fund of Funds Tax Saver Hybrid Solution Oriented ETF Goal based solutions Wealth creation Tax Savings Children's Fund Retirement Planning Income Solutions Chhoti SIP VIEW ALL Learn MF Simplified Blogs Quiz Videos Zindagi ke liye SIP Macros, Markets and More Market Review Monetary Policy HDFC MF Yearbook Webinars Deep Dives Tuesday Talking Point Weekend Bytes HDFC MF Insights Handbooks MD and CEO'S Desk Interviews and Articles Videos Calculators SIP Calculator SWAP Calculator Top up SIP Impact of inflation STP calculator Goal SIP Present value Retirement SIP Calculator Cost of child education Investor Services Fund Related Details Factsheet Fund Documents Fund Literature Additional fund Information Our Online Services MF Online Investors Quick Invest Update Contact Details Forms & Disclosures Statutory Disclosures Forms, Addenda & Notices FAQ’s Investor Awareness Program IAP Downloads Investor Awareness Programmes KYC & Redressal of Complaints About Us Corporate Profile HDFC MF at a Glance Corporate Social Responsibility What we stand for What Sets Us Apart Environmental, Social and Governance AMC Shareholder Financial Information Corporate Governance Forms & Circulars MOA & AOA Others Media Center Our Board and Trustees Distributor Corner Login Become an MFD Onboard Digitally Forms & Disclosures One Click Link FAQs S I G N I N -A A +A HDFC Small Cap Fund Equity DIRECT REGULAR An open ended equity scheme predominantly investing in small cap stocks. The Scheme shall follow a predominantly small cap strategy with a minimum exposure of 65% to small cap stocks. The Scheme may also seek participation in other equity and equity related securities to achieve optimal portfolio construction. The aim of equity strategy will be to predominantly build a portfolio of small-cap companies which have: reasonable growth prospects sound financial strength sustainable business models acceptable valuation that offers potential for capital appreciation. Returns since inception 19.79% Inception Date 01/01/2013 Riskometer Very High Min SIP ₹ 100 Ideal for Wealth Creation 3 Years and above Entry Load An entry load is a fee charged to investors when they purchase units of a Mutual Fund scheme. This fee was used to cover distribution and marketing expenses incurred by the Asset Management Company (AMC). Currently, Mutual Funds in India do not levy entry loads. NA TER TER The Total Expense Ration (TER) represents the costs for running and managing a Mutual Fund scheme. It is calculated as a percentage of the scheme’s average Net Asset Value (NAV). The daily NAV of a Mutual Fund is disclosed after deducting these expenses. Disclaimer Including Additional Expenses and Goods and Service Tax on Management Fees, if any. Click here to view the Total Expense Ratio 0.67 Lock in A lock-in period is the fixed duration during which investors cannot sell or redeem their investments/Mutual Fund units. For example, Equity Linked Savings Schemes (ELSS) Funds have a 3-year lock-in. NA NAV NA Net Asset Value (NAV) per unit is the total market value of securities of a scheme minus liabilities divided by the total number of outstanding units on a given date. NA AUM (31/10/2025) Assets Under Management (AUM) is the total market value of all assets that a Mutual Fund manages on behalf of its investors. ₹38,412.10 Cr. Benchmark A benchmark is a standard market index used to compare a Fund’s performance. It helps investors know whether the Fund is performing better, worse, or similar to the market. BSE 250 SmallCap Ind... BSE 250 SmallCap Index (Total Returns Index) INVEST NOW Performance No data available Scheme Returns (%) Benchmark Returns (%)# Additional Benchmark Returns (%)## Value of Investment of Rs 10,000 Scheme Returns (Rs.) Benchmark (Rs.)# Additional Benchmark (Rs.)## ^Past performance may or may not be sustained in future and is not a guarantee of any future returns. # BSE 250 SmallCap Index TRI... Read More Fund Managers Mr. Chirag Setalvad Fund Manger- Head of Equities OVERSEAS Mr. Dhruv Muchhal Equity Analyst and Fund Manager for Overseas Investments Top 10 Holdings As on 31 Oct 2025 Downloads HDFC Small Cap Fund SID - HDFC Small Cap Fund dated May 30, 2025 KIM - HDFC Small Cap Fund dated May 30, 2025 Leaflet HDFC Small Cap Fund - Presentation (October 2025) Fund Facts - HDFC Small Cap Fund_September 25.pdf Exit Load In respect of each purchase / switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed / switched out within 1 year from the date of allotment. No Exit Load is payable if Units are redeemed / switched out after 1 year from the date of allotment. Product Labelling Benchmark Riskometer This product is suitable for investors who are seeking~ to generate long-term capital appreciation/income investments predominantly in Small-Cap companies ~Investors should consult their financial advisers if in doubt about whether the product is suitable for them. FAQs Can I invest in SIP and Lump Sum of HDFC Small Cap Fund ? Yes, SIP as well as Lump Sum investments are permitted with the minimum application amount being ₹100. Any additional purchase must have a minimum amount of ₹100 The SIP and Lumpsum are available in direct and regular plan with both Growth and IDCW option. OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world OUR MISSION To be the wealth creator for every Indian OUR VISION To be the most respected asset manager in the world Address HDFC House, 2nd floor, 166, HT Parekh Marg, Churchgate, Mumbai, Maharashtra 400020, India Contact Us 180030106767 [email protected] 8270682706 Follow Us IMPORTANT LINKS PMS/AIF (Login) Statutory Disclosures (MF/ AIF/ PMS) Contact Us Careers ODR Portal for AMC Shareholders ODR for Investors (HDFC MF, PMS and AIF) HDFC Mutual Fund Glossary Public Caution Notice Chhoti SIP INVESTORS Total Expense Ratio (TER) NAV and IDCW FAQ’s Monthly & Fortnightly Scheme Portfolio Market Update DOWNLOADS Forms Product Information Factsheet Scheme Annual Report Scheme Performance Summary Addendum & Notices DISTRIBUTORS Log In Become an MFD Onboard Digitally Forms & Disclosures One click Link FAQs Fund Categories: Equity Debt Hybrid Solution Oriented Fund of Funds ETF Tax Saver Index Close Ended Most Searched Funds: HDFC Flexi Cap Fund HDFC Balanced Advantage Fund HDFC Large Cap Fund HDFC Mid Cap Fund HDFC Small Cap Fund View All Calculators: cost of child education calculator goal sip calculator Inflation Calculator present value calculator Retirement Calculator SIP Calculator STP Calculator SWAP Calculator top up sip calculator HDFC Group Websites: HDFC Bank HDFC Securities HDFC Ergo HDB Financial Services HDFC Capital HDFC Life HDFC Pension HDFC Sales HT Parekh Foundation Info & Disclosures: Disclaimer Privacy Policy Sitemap MUTUAL FUND INVESTMENTS ARE SUBJECT TO MARKET RISKS, READ ALL SCHEME RELATED DOCUMENTS CAREFULLY ©Copyright 2025 . All rights reserved.", "plan_type": "Direct", "option": null, "risk_level": "low", "fund_rating": null, "nav_date": null, "nav_value": null, "fund_size_cr": 38412.1, "min_lumpsum_first_investment": null, "min_lumpsum_additional": null, "min_sip_amount": 100.0, "returns_1y_percent": null, "returns_3y_percent": null, "returns_5y_percent": null, "returns_all_percent": 19.79, "category_avg_1y_percent": null, "category_avg_3y_percent": null, "category_avg_5y_percent": null, "category_avg_all_percent": null, "rank_within_category_1y": null, "rank_within_category_3y": null, "rank_within_category_5y": null, "rank_within_category_all": null, "top_5_holdings_weight_percent": null, "top_20_holdings_weight_percent": null, "pe_ratio": null, "pb_ratio": null, "alpha": null, "beta": null, "sharpe_ratio": null, "sortino_ratio": null, "expense_ratio_percent": 0.67, "expense_ratio_inclusive_of_gst": true, "exit_load_text": "In respect of each purchase / switch-in of Units, an Exit Load of 1.00% is payable if Units are redeemed / switched out within 1 year from the date of allotment. No Exit Load is payable if Units are redeemed / switched out after 1 year from the date of allotment.", "stamp_duty_text": null, "tax_implication_text": null, "fund_manager_name": "Chirag Setalvad Fund Manger, Dhruv Muchhal Equity Analyst", "fund_manager_since": null, "fund_manager_tenure_text": null, "source_url": "https://www.hdfcfund.com/explore/mutual-funds/hdfc-small-cap-fund/direct", "last_scraped_at": "2025-11-17T14:12:48.306164+00:00"}
